Tekla Open API Reference for Tekla Structures 2025
WeldMark.WeldMarkAttributes.ShowReferenceText Property
 Gets or sets visibility of the weld mark reference text.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ShowReferenceText { get; set; }
Public Property ShowReferenceText As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
WeldMark.WeldMarkAttributes Class
Tekla.Structures.Drawing Namespace